[
    {
        "type": "multiple-choice",
        "competence": "3.1",
        "level": "Intermedio 1",
        "title": "Licencias Creative Commons",
        "scenario": "Quieres usar una foto de internet para tu blog educativo sin infringir derechos.",
        "options": [
            "Opción A: Buscar en bancos de imágenes con filtro CC-BY o dominio público",
            "Opción B: Copiar cualquier imagen de Google Imágenes",
            "Opción C: Usarla igual pero poner \"Créditos al autor desconocido\"",
            "Opción D: Modificarla con Photoshop para que \"no se note\""
        ],
        "correctAnswerIndex": 0,
        "feedback": {
            "correct": "¡Correcto! Las licencias CC permiten usos específicos legalmente.",
            "incorrect": "El reconocimiento no sustituye el permiso. Respeta siempre los derechos de autor."
        }
    },
    {
        "type": "multiple-choice",
        "competence": "3.2",
        "level": "Básico 2",
        "title": "Remezclar contenido educativo",
        "scenario": "Tienes un video propio, una infografía CC y audio libre para crear material didáctico.",
        "options": [
            "Opción A: Combinarlos citando cada fuente según sus licencias",
            "Opción B: Usarlos sin mencionar procedencia",
            "Opción C: Subirlo todo como creación 100% original",
            "Opción D: Evitar mezclar \"por si hay problemas\""
        ],
        "correctAnswerIndex": 0,
        "feedback": {
            "correct": "¡Bien hecho! La remezcla ética enriquece la creación digital.",
            "incorrect": "El contenido derivado debe respetar las condiciones originales de cada componente."
        }
    },
    {
        "type": "multiple-choice",
        "competence": "3.4",
        "level": "Intermedio 1",
        "title": "Automatizar tareas simples",
        "scenario": "Trabajas con un archivo Excel de 500 filas que requiere repetir operaciones.",
        "options": [
            "Opción A: Grabar macro o usar fórmulas avanzadas como BUSCARV",
            "Opción B: Hacer todo manualmente fila por fila",
            "Opción C: Contratar a alguien para que lo haga",
            "Opción D: Abandonar el trabajo por complejo"
        ],
        "correctAnswerIndex": 0,
        "feedback": {
            "correct": "¡Excelente! La programación básica optimiza procesos repetitivos.",
            "incorrect": "Las herramientas ofimáticas tienen funciones avanzadas que ahorran horas de trabajo."
        }
    },
    {
        "type": "multiple-choice",
        "competence": "3.1",
        "level": "Básico 2",
        "title": "Crear presentación efectiva",
        "scenario": "Debes hacer una PPT para defender tu proyecto final de curso ante evaluadores.",
        "options": [
            "Opción A: Usar diseño limpio, puntos clave y gráficos explicativos",
            "Opción B: Poner párrafos extensos en cada diapositiva",
            "Opción C: Usar 10 tipos de letra y animaciones excesivas",
            "Opción D: Leer directamente las diapositivas sin añadir valor"
        ],
        "correctAnswerIndex": 0,
        "feedback": {
            "correct": "¡Perfecto! Menos es más: el contenido debe reforzar (no repetir) tu exposición.",
            "incorrect": "Las presentaciones son apoyo visual, no documento completo. Prioriza claridad."
        }
    },
    {
        "type": "multiple-choice",
        "competence": "3.3",
        "level": "Intermedio 1",
        "title": "Citar fuentes digitales",
        "scenario": "Incluyes ideas de un artículo web en tu investigación académica.",
        "options": [
            "Opción A: Usar normas APA/Chicago con autor, fecha, título y URL",
            "Opción B: Poner solo el link en el pie de página",
            "Opción C: No citar porque \"es información pública\"",
            "Opción D: Parafrasear cambiando algunas palabras sin referencia"
        ],
        "correctAnswerIndex": 0,
        "feedback": {
            "correct": "¡Correcto! La citación formal da credibilidad y evita plagio.",
            "incorrect": "Incluso las ideas parafraseadas requieren atribución. Usa siempre estándares académicos."
        }
    }
]