[
    {
        "type": "multiple-choice",
        "competence": "5.1",
        "level": "Intermedio 1",
        "title": "Error de conexión a internet",
        "scenario": "Tu computadora muestra \"Sin conexión a internet\" pero el router parece funcionar.",
        "options": [
            "Opción A: Reiniciar dispositivo/router, verificar cables y ejecutar solucionador de problemas",
            "Opción B: Golpear el router \"para que funcione\"",
            "Opción C: Llamar inmediatamente al técnico sin diagnosticar",
            "Opción D: Esperar días a que se solucione solo"
        ],
        "correctAnswerIndex": 0,
        "feedback": {
            "correct": "¡Correcto! El 80% de fallos se resuelven con pasos básicos de diagnóstico.",
            "incorrect": "Sigue un método: aisla el problema (¿es el dispositivo, la red local o el proveedor?) antes de actuar."
        }
    },
    {
        "type": "multiple-choice",
        "competence": "5.2",
        "level": "Básico 2",
        "title": "Elegir herramienta digital",
        "scenario": "Necesitas crear un diagrama de flujo para explicar un proceso en tu equipo.",
        "options": [
            "Opción A: Investigar y comparar opciones (ej: Lucidchart vs Draw.io) según necesidades",
            "Opción B: Usar Excel porque \"es lo único que sabes\"",
            "Opción C: Dibujarlo a mano, fotografiarlo y enviar por WhatsApp",
            "Opción D: Pedirle a un colega que lo haga por ti"
        ],
        "correctAnswerIndex": 0,
        "feedback": {
            "correct": "¡Excelente! La herramienta debe adaptarse a la tarea, no al revés.",
            "incorrect": "Explora opciones: existen herramientas gratuitas especializadas para casi cualquier necesidad."
        }
    },
    {
        "type": "multiple-choice",
        "competence": "5.3",
        "level": "Intermedio 1",
        "title": "Automatizar recordatorios",
        "scenario": "Sueles olvidar pagos de servicios y quieres solución digital.",
        "options": [
            "Opción A: Configurar calendario con alertas o apps como BillTracker",
            "Opción B: Confiar en tu memoria",
            "Opción C: Pegar post-its en el monitor",
            "Opción D: Pedir a tu pareja que te recuerde"
        ],
        "correctAnswerIndex": 0,
        "feedback": {
            "correct": "¡Bien hecho! La tecnología es tu aliada para hábitos organizativos.",
            "incorrect": "Usa sistemas externos confiables: la memoria humana es falible para tareas repetitivas."
        }
    },
    {
        "type": "multiple-choice",
        "competence": "5.4",
        "level": "Básico 2",
        "title": "Identificar brecha digital",
        "scenario": "Un familiar mayor te pide ayuda porque no sabe usar banca móvil y quiere aprender.",
        "options": [
            "Opción A: Evaluar su nivel actual y crear plan paso a paso con paciencia",
            "Opción B: Hacerle todo tú \"por rapidez\"",
            "Opción C: Decirle que \"ya es muy viejo para eso\"",
            "Opción D: Darle manual técnico para que lea solo"
        ],
        "correctAnswerIndex": 0,
        "feedback": {
            "correct": "¡Perfecto! La alfabetización digital requiere empatía y adaptación al ritmo del aprendiz.",
            "incorrect": "Todos podemos desarrollar competencias digitales con enseñanza adecuada. Sé facilitador."
        }
    },
    {
        "type": "multiple-choice",
        "competence": "5.1",
        "level": "Intermedio 1",
        "title": "Recuperar archivo no guardado",
        "scenario": "Se apaga la luz mientras editas un documento importante sin haber guardado.",
        "options": [
            "Opción A: Buscar archivos temporales o función \"Recuperar\" al reiniciar el programa",
            "Opción B: Maldecir y empezar desde cero",
            "Opción C: Pagar por software de recuperación caro inmediatamente",
            "Opción D: Culpar a otros por el problema"
        ],
        "correctAnswerIndex": 0,
        "feedback": {
            "correct": "¡Correcto! Muchos programas guardan autobackups temporales periódicos.",
            "incorrect": "Mantén la calma: explora opciones de recuperación antes de asumir pérdida total."
        }
    }
]